tiborsimon/embedded-tdd-headers/pic/pic18/pic18f45j50_tdd.h
#define CCH01                         1649
#define CCH11                         1650
#define C1CH1                         1651
#define CM1CON_CCH1                   1652
#define CM1CON_CREF                   1653
#define CREF1                         1654
#define EVPOL01                       1655
#define CM1CON_EVPOL0                 1656
#define CM1CON_EVPOL                  1657
#define CM1CON_EVPOL1                 1658
#define EVPOL11                       1659
#define CM1CON_CPOL                   1660
#define CPOL1                         1661
#define CM1CON_COE                    1662
#define COE1                          1663
#define CM1CON_CON                    1664
#define CON1                          1665
#define OSCCON                        1666
#define SCS0                          1667
#define SCS                           1668
#define SCS1                          1669
#define OSTS                          1670
#define IRCF                          1671
#define IRCF0                         1672
#define IRCF1                         1673
#define IRCF2                         1674
#define IDLEN                         1675
#define T0CON                         1676
#define T0PS                          1677
#define T0PS0                         1678
#define T0PS1                         1679
#define T0PS2                         1680
#define PSA                           1681
#define T0SE                          1682
#define T0CS                          1683
#define T08BIT                        1684
#define TMR0ON                        1685
#define TMR0L                         1686
#define TMR0H                         1687
#define STATUS                        1688
#define C                             1689
#define CARRY                         1690
#define DC                            1691
#define ZERO                          1692
#define Z                             1693
#define OV                            1694
#define OVERFLOW                      1695
#define N                             1696
#define NEGATIVE                      1697
#define FSR2L                         1698
#define PLUSW2                        1699
#define PREINC2                       1700
#define POSTDEC2                      1701
#define POSTINC2                      1702
#define INDF2                         1703
#define FSR1L                         1704
#define PLUSW1                        1705
#define PREINC1                       1706
#define POSTDEC1                      1707
#define POSTINC1                      1708
#define INDF1                         1709
#define WREG                          1710
#define FSR0L                         1711
#define PLUSW0                        1712
#define PREINC0                       1713
#define POSTDEC0                      1714
#define POSTINC0                      1715
#define INDF0                         1716
#define INTCON3                       1717
#define INT1IF                        1718
#define INT1F                         1719
#define INT2IF                        1720
#define INT2F                         1721
#define INT3F                         1722
#define INT3IF                        1723
#define INT1E                         1724
#define INT1IE                        1725
#define INT2IE                        1726
#define INT2E                         1727
#define INT3E                         1728
#define INT3IE                        1729
#define INT1P                         1730
#define INT1IP                        1731
#define INT2IP                        1732
#define INT2P                         1733
#define INTCON2                       1734
#define RBIP                          1735
#define INT3IP                        1736
#define INT3P                         1737
#define TMR0IP                        1738
#define T0IP                          1739
#define INTEDG3                       1740
#define INTEDG2                       1741
#define INTEDG1                       1742
#define INTEDG0                       1743
#define RBPU                          1744
#define NOT_RBPU                      1745
#define nRBPU                         1746
#define INTCON                        1747
#define RBIF                          1748
#define INT0F                         1749
#define INT0IF                        1750
#define T0IF                          1751
#define TMR0IF                        1752
#define RBIE                          1753
#define INT0E                         1754
#define INT0IE                        1755
#define T0IE                          1756
#define TMR0IE                        1757
#define PEIE                          1758
#define PEIE_GIEL                     1759
#define GIEL                          1760
#define GIE_GIEH                      1761
#define GIE                           1762
#define GIEH                          1763
#define PRODL                         1764
#define PRODH                         1765
#define TABLAT                        1766
#define TBLPTRL                       1767
#define TBLPTRH                       1768
#define PCL                           1769
#define PCLATH                        1770
#define PCH                           1771
#define SP0                           1772
#define STKPTR                        1773
#define SP1                           1774
#define SP2                           1775
#define SP3                           1776
#define SP4                           1777
#define STKUNF                        1778
#define STKOVF                        1779
#define STKFUL                        1780
#define TOSL                          1781
#define TOSH                          1782

#endif // _PIC18F45J50_H_
